"qr.noname" = "No name";

"showDetails.button.title" = "Show details";

"settings.bugWithWidget.question" = "I cannot find widget in widget gallery";
"settings.bugWithWidget.answer" = "Unfortunately, this is a bug in iOS. Restart your phone, then open the app. After that, the widget will appear in widget gallery";
"settings.howToAddWidget" = "How to add widget?";

"appleWallet.failedToCreatePass" = "Failed to create QR for Apple Wallet";
"appleWallet.qrAlreadyAdded" = "QR-code added to Apple Wallet. If you add again, QR-code will be updated";
"appleWallet.tryAgain" = "Please try again";
"appleWallet.progress" = "Creating QR for Apple Wallet";

// Common
"cancel" = "Cancel";
"save" = "Save";
"continue" = "Continue";
"repeat" = "Repeat";
"activate" = "Activate";

"deleteQr.caution" = "Do you want to delete QR-code?";
"deleteQr.buttonTitle" = "Remove";

"paywall.plan.introductory.free" = "%@ Free";
"paywall.plan.introductory.periodAndPrice" = "%@ for %@";
"paywall.plan.thenPrice" = "Then %@ / %@";
"paywall.restore" = "Restore";
"paywall.oneTimePurchase" = "One-Time Purchase";
"paywall.popular" = "Popular";

"paywall.freeVersion" = "Free version";
"paywall.feature.scanner.title" = "Scanner";
"paywall.feature.scanner.subtitle" = "Use camera or photos to add new QR-code";
"paywall.feature.sharing.title" = "Share";
"paywall.feature.sharing.subtitle" = "Export QR-codes as text or image";
"paywall.feature.noAds.title" = "No ads";
"paywall.feature.noAds.subtitle" = "Enjoy the app without being interrupted by ads";

"paywall.proVersion" = "Pro version";
"paywall.feature.appleWallet.title" = "Apple Wallet";
"paywall.feature.appleWallet.subtitle" = "Easy access to your QR-codes from Apple Wallet";
"paywall.feature.batchScan.title" = "Batch scan";
"paywall.feature.batchScan.subtitle" = "Scan multiple codes at the same time without any extra steps";
"paywall.feature.customization.title" = "Customization";
"paywall.feature.customization.subtitle" = "Change QR-codes colors, adjust error correction level";
"paywall.feature.widgets.title" = "Widgets";
"paywall.feature.widgets.subtitle" = "Add QR-codes on main screen of your iPhone to get fastest access";
"paywall.feature.appleWatch.title" = "Apple Watch";
"paywall.feature.appleWatch.subtitle" = "Add Apple Watch Complication on your Watch face to get access to QR-codes in one tap";

"paywall.termsOfUse" = "Terms of Use";
"paywall.privacyPolicy" = "Privacy Policy";

"subscription.expired" = "Subscription expired";
"subscription.activated" = "You have unlocked Pro version!";

"tabs.settings" = "Settings";
"tabs.scan" = "Scan";
"tabs.favorites" = "Favorites";
"tabs.history" = "History";

"settings.general" = "General";
"settings.contactDeveloper" = "Contact Developer";
"settings.writeReview" = "Write Review";
"settings.scanner" = "Scanner";
"settings.vibration" = "Vibration";
"settings.title" = "Settings";
"settings.faq" = "FAQ";
"settings.pro.title" = "Pro version";
"settings.pro.describtion" = "Activate more features for your QR-codes";

"qrDetails.title" = "Details";
"qrDetails.removeFromFavorites" = "Remove from favorites";
"qrDetails.addToFavorites" = "Add to Favorites";
"qrDetails.appleWalletPass" = "Apple Wallet Pass";
"qrDetails.name.placeholder" = "You may name QR, e.g. Movie ticket";

"onboarding.qrOnMainScreen" = "QR-code on main screen";
"onboarding.allQRCodesInOnePlace" = "All QR-codes in one place";

"history.title" = "Scan History";
"history.empty.title" = "No QR-codes yet";
"history.empty.subtitle" = "Here will be all scanned QR-codes";
"history.batch" = "Batch of codes";
"history.batch.countOfCodes" = "%d QR-codes";

"sharing.asImage" = "As Image";
"sharing.asText" = "As Text";
"sharing.title" = "Share";

"flipperQr.info.text" = "Tap on QR-code to see standard QR-code colors";

"changeAppearance.title" = "Appearance";
"changeAppearance.foregroundColor" = "Foreground color";
"changeAppearance.backgroundColor" = "Background color";
"changeAppearance.colors" = "Colors";
"changeAppearance.errorCorrectionLevel" = "Error correction level";
"changeAppearance.buttonTitle" = "Change appearance";

"scanner.result.title" = "Scan Result";
"scanner.about.title" = "About batch scan";
"scanner.about.subtitle" = "Use this mode when you want to scan many QR-codes one by one. Scanned codes will be shown as group on History tab";
"scanner.startButton" = "Start";
"scanner.qrNotFound" = "QR-code not found";
"scanner.scanButton" = "Batch Scan";
"scanner.stopButton" = "Stop";
"scanner.scannedCount" = "Scanned %d";

"favorites.empty.title" = "No favorite QR-codes yet";
"favorites.empty.subtitle" = "You can add favorites right after scanning or from History tab";

"qrType.website" = "Website";
"qrType.text" = "Text";
